//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
#include<stdio.h>
#include<Windows.h>
void Game()
{
	int a = 1;
	for (; a <= 5; a++){
		int b = 1;
		for (; b <= 5; b++){
			int c = 1;
			for (; c <= 5; c++){
				int d = 1;
				for (; d <= 5; d++){
					int e = 1;
					for (; e <= 5; e++){
						//A选手说：B第二，我第三；((b==2)+(a==3)==1)
						//B选手说：我第二，E第四；((b==2)+(e==4)==1)
						//C选手说：我第一，D第二；((c==1)+(d==2)==1)
						//D选手说：C最后，我第三；((c==5)+(d==3)==1)
						//E选手说：我第四，A第一；((e==4)+(a==1)==1)
						if (((b == 2) + (a == 3) == 1) && \
							((b == 2) + (e == 4) == 1) && \
							((c == 1) + (d == 2) == 1) && \
							((c == 5) + (d == 3) == 1) && \
							((e == 4) + (a == 1) == 1))
						{
							unsigned char flag = 0;// flag 0000 0000 当排名出现时，相应位置取1，否则取0
							flag |= (1 << (a - 1));
							flag |= (1 << (b - 1)); 
							flag |= (1 << (c - 1));
							flag |= (1 << (d - 1));
							flag |= (1 << (e - 1));
							while (flag)
							{
								if (flag & 1)
								{
									flag >>= 1;
								}
								else
								{
									break;
								}
							}
							if (!flag)
							printf("a:%d b:%d c:%d d:%d e:%d\n", a, b, c, d, e);
						}
					}
				}
			}
		}
	}
}
int main()
{
	Game();
	system("pause");
	return 0;
}